{
    "terms": [
      {
        "title": "Introduction",
        "content": "By accessing this website, we assume you accept these terms and conditions. Do not continue to use Craft Construct if you do not agree to take all of the terms and conditions stated on this page."
      },
      {
        "title": "Intellectual Property Rights",
        "content": "Unless otherwise stated, Craft Construct and/or its licensors own the intellectual property rights for all material on this website. All intellectual property rights are reserved. You may access this from Craft Construct for your own personal use subjected to restrictions set in these terms and conditions."
      },
      {
        "title": "User Comments",
        "content": "Certain parts of this website offer users the opportunity to post and exchange opinions and information. Craft Construct does not filter, edit, publish, or review Comments prior to their presence on the website. Comments do not reflect the views and opinions of Craft Construct, its agents, or affiliates."
      },
      {
        "title": "Hyperlinking to our Content",
        "content": "Organizations may link to our website without prior written approval including government agencies, search engines, and news organizations. However, such links should not mislead, imply endorsement, or falsely represent a relationship with Craft Construct."
      },
      {
        "title": "Limitation of Liability",
        "content": "In no event shall Craft Construct, nor any of its officers, directors, and employees, be liable for anything arising out of or in any way connected with your use of this website."
      },
      {
        "title": "Modifications",
        "content": "Craft Construct reserves the right to revise these terms at any time as it sees fit, and by using this website you are expected to review these terms regularly."
      },
      {
        "title": "Governing Law",
        "content": "These terms and conditions are governed by and construed in accordance with the laws of [Your Jurisdiction] and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location."
      }
    ]
  }